In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5',],columns=['Column1','Column2','Column3','Column4'])
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int64

In [6]:
type(df.loc['Row1'])
# The datatype is series because the number of rows is = 1

pandas.core.series.Series

In [7]:
type(df['Column1'])
# The datatype is series because the number of columns is = 1

pandas.core.series.Series

In [8]:
df.loc[['Row1','Row2']]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7

In [9]:
type(df.loc[['Row1','Row2']])

pandas.core.frame.DataFrame

In [10]:
df.iloc[:,1:2]

      Column2
Row1        1
Row2        5
Row3        9
Row4       13
Row5       17

In [11]:
df.iloc[1:,:]

      Column1  Column2  Column3  Column4
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [12]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [14]:
# This is probably useful for computation as the ndarrays will be faster than the data frames.
type(df.values)

numpy.ndarray

In [15]:
df.Column1.isnull()

Row1    False
Row2    False
Row3    False
Row4    False
Row5    False
Name: Column1, dtype: bool

In [21]:
df.isnull()

      Column1  Column2  Column3  Column4
Row1    False    False    False    False
Row2    False    False    False    False
Row3    False    False    False    False
Row4    False    False    False    False
Row5    False    False    False    False

In [19]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [20]:
df['Column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64